Revit 2027 API
ParameterTypeId.PrimaryOptionId Property
 "Primary Option Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PrimaryOptionId { get; }
Public Shared ReadOnly Property PrimaryOptionId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PrimaryOptionId {
	ForgeTypeId^ get ();
}
static member PrimaryOptionId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace